dragoncraft87/PC-Monitor/sdkconfig.defaults
# ============================================================================
# PC Monitor - LVGL Configuration for ESP32-S3 N16R8 with PSRAM
# ============================================================================

# ESP32-S3 with Octal PSRAM (8MB)
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM=y

# PSRAM Configuration
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=0
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Memory allocation strategy
CONFIG_SPIRAM_MEMTEST=y
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# FreeRTOS - Use PSRAM for large stacks
CONFIG_FREERTOS_SUPPORT_STATIC_ALLOCATION=y
CONFIG_FREERTOS_PLACE_FUNCTIONS_INTO_FLASH=y

# Compiler optimization
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# SPI Configuration
CONFIG_SPI_MASTER_ISR_IN_IRAM=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_INFO=y

# USB Serial JTAG
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Partition Table
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
